# Data Cleaning and Preparation

In [1]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

## Handling Missing Data

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data
string_data.isnull()
# reveals which index values are null (missing, empty)

0    False
1    False
2     True
3    False
dtype: bool

In [3]:
string_data[0] = None
print(string_data)
string_data.isnull()
# replacing an existing value with null (correction)

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [4]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])

data.notnull()
# reveals whether/not value is not null

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [5]:
data.dropna()
# removes (drops) null/NaN values from data set

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data[data.notnull()]
# SAME AS ABOVE
# returns values in data set ONLY from not-null cells

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
print(data)
cleaned
# drops nulls & returns only rows with complete values (no null values)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

     0    1    2
0  1.0  6.5  3.0

In [8]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [9]:
data[4] = NA
# create column labeled '4' filled with NA values
print(data)

data.dropna(axis=1, how='all')
# drops all null columns (axis=1)

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.204708       NaN       NaN
1 -0.555730       NaN       NaN
2  0.092908       NaN  0.769023
3  1.246435       NaN -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [11]:
df.dropna()
# drops ALL rows and columns with ANY null values

df.dropna(thresh=3)
# drops nulls ONLY from FIRST N rows (n=2 here)

          0         1         2
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

### Filling In Missing Data

In [12]:
df.fillna(0)
# replaces/fills null values with 0

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [13]:
df.fillna({1: 0.5, 2: 0})
# fills null values in specific columns
# nulls in column 1 --> 0.5
# nulls in column 2 --> 0

          0         1         2
0 -0.204708  0.500000  0.000000
1 -0.555730  0.500000  0.000000
2  0.092908  0.500000  0.769023
3  1.246435  0.500000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [14]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.204708  0.000000  0.000000
1 -0.555730  0.000000  0.000000
2  0.092908  0.000000  0.769023
3  1.246435  0.000000 -1.296221
4  0.274992  0.228913  1.352917
5  0.886429 -2.001637 -0.371843
6  1.669025 -0.438570 -0.539741

In [15]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772       NaN  1.343810
3 -0.713544       NaN -2.370232
4 -1.860761       NaN       NaN
5 -1.265934       NaN       NaN

In [16]:
df.fillna(method='ffill')
# fills nulls with repeated previous value

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.124121  1.343810
3 -0.713544  0.124121 -2.370232
4 -1.860761  0.124121 -2.370232
5 -1.265934  0.124121 -2.370232

In [17]:
df.fillna(method='ffill', limit=2)
# same as above, but limits replacement to 2 values at a time

          0         1         2
0  0.476985  3.248944 -1.021228
1 -0.577087  0.124121  0.302614
2  0.523772  0.124121  1.343810
3 -0.713544  0.124121 -2.370232
4 -1.860761       NaN -2.370232
5 -1.265934       NaN -2.370232

In [18]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())
# creates series & fills null spaces with mean of series

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation

### Removing Duplicates

In [19]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [20]:
data.duplicated()
# returns whether/not values in each row is a duplicate (repeated elsewhere in data set)
# rows 5 and 6 are the same. row 6 is the duplicated value

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [21]:
data.drop_duplicates()
# drops duplicated values (row 6)

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [22]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [23]:
data.drop_duplicates(['k1'])
# drops duplicated values in specified column

    k1  k2  v1
0  one   1   0
1  two   1   1

In [24]:
data.drop_duplicates(['k1', 'k2'], keep='last')
# keep options: first, last, False (default= ‘first’)
# Determines which duplicates (if any) to keep.
# first : Drop duplicates except for the first occurrence.
# last : Drop duplicates except for the last occurrence. 
# False : Drop all duplicates.

# dropped row 5 because when comparing k1 & k2, rows 5 & 6 are duplicates. keep last --> keep row 6, drops row 5

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [25]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
print(type(data.ounces[0]))    # numpy converted ounces to floats for analysis
data

<class 'numpy.float64'>

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [26]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [27]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [28]:
data['animal'] = lowercased.map(meat_to_animal)
data
# creating new column 'animal' and uses map function to match values in 'food' to 'meat_to_animal'

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [29]:
data['food'].map(lambda x: meat_to_animal[x.lower()])
# same output as above

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [30]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [31]:
data.replace(-999, np.nan)
# replace single value with input (NaN)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [32]:
data.replace([-999, -1000], np.nan)
# replaces multiple values  in [list] with input (NaN)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [33]:
data.replace([-999, -1000], [np.nan, 0])
# respectively, replace -999 with Nan & replace -1000 with 0

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [34]:
data.replace({-999: np.nan, -1000: 0})
# SAME AS ABOVE, using dictionary format to redefine values

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [35]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data
# unsure why default fills cells with numbered values
# can use data[:] = np.nan to empty cells

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [36]:
transform = lambda x: x[:4].upper()
data.index.map(transform)
data
# created function transform that works to capitalize (upper)
# take data df, look at the index, map uppercase values from transform onto the index

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [37]:
data.index = data.index.map(transform)
data
# SAME AS ABOVE. uses function transform to create new variable that = the index mapped onto transform

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [38]:
data.rename(index=str.title, columns=str.upper)
# converts rows index to 'title' format (capitalize first letter) and columns index to uppercase

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [39]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})
# rename specific columns using dictionary

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [42]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [54]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
pd.cut?
cats = pd.cut(ages, bins)
output = pd.Series(cats)    # converted to series for better formatting
output

# pd.cut returns which bin the index falls between
# Use `cut` when you need to segment and sort data values into bins. Function is also useful for going 
# from a continuous variable to a categorical variable. For ex, `cut` could convert ages to groups of age ranges.

0      (18, 25]
1      (18, 25]
2      (18, 25]
3      (25, 35]
4      (18, 25]
5      (18, 25]
6      (35, 60]
7      (25, 35]
8     (60, 100]
9      (35, 60]
10     (35, 60]
11     (25, 35]
dtype: category
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [58]:
cats.codes
# Codes are an array of integers which are the positions of the actual values in the categories array.
# because cats returns bins, cats.codes returns the position of each bin

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [59]:
cats.categories
# returns the list of bins that cats is comprised of (line 54)

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [65]:
pd.value_counts(cats)
# because cats returns bins, value_counts returns how many values fall within each binn

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [68]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)
# pd.cut(... right= Indicates whether each bins includes the upper bound or not). Default is True, hence closed right
# brackets above & below

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [71]:
pd.cut(ages, [18, 26, 36, 61, 100])
# pd.cut(... right= Indicates whether each bins includes the upper bound or not.)

[(18, 26], (18, 26], (18, 26], (26, 36], (18, 26], ..., (26, 36], (36, 61], (36, 61], (36, 61], (26, 36]]
Length: 12
Categories (4, interval[int64, right]): [(18, 26] < (26, 36] < (36, 61] < (61, 100]]

In [88]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
print(group_names)
print(bins)

pd.Series(pd.cut(ages, bins, labels=group_names))    # formatted as series for ease

# from ages, returns which bins the data falls into based on specified labels

['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
[18, 25, 35, 60, 100]

0          Youth
1          Youth
2          Youth
3     YoungAdult
4          Youth
5          Youth
6     MiddleAged
7     YoungAdult
8         Senior
9     MiddleAged
10    MiddleAged
11    YoungAdult
dtype: category
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [89]:
data = np.random.rand(20)
# generate 20 random numbers
print(data)

pd.cut(data, 4, precision=2)
# pd.cut will put sort data into n (4) bins
# precision= the precision at which to store and display the bins labels (int). default = 3

[0.6522 0.5132 0.6824 0.4895 0.9265 0.5159 0.0722 0.5675 0.6152 0.9415
 0.4154 0.2644 0.0974 0.4858 0.4647 0.0298 0.6943 0.7169 0.7298 0.4144]

[(0.49, 0.71], (0.49, 0.71], (0.49, 0.71], (0.49, 0.71], (0.71, 0.94], ..., (0.029, 0.26], (0.49, 0.71], (0.71, 0.94], (0.71, 0.94], (0.26, 0.49]]
Length: 20
Categories (4, interval[float64, right]): [(0.029, 0.26] < (0.26, 0.49] < (0.49, 0.71] < (0.71, 0.94]]

In [98]:
data = np.random.randn(1000)  # Normally distributed
cats = pd.qcut(data, 5)  # Cut into n (5) equal segments (quintiles)
cats
pd.value_counts(cats)    # pd.cut --> bins    pd.qcut creates evenly spaced bins    
# value_count returns how many values fall into each bin

(-3.195, -0.836]    200
(-0.836, -0.217]    200
(-0.217, 0.253]     200
(0.253, 0.838]      200
(0.838, 3.024]      200
dtype: int64

In [99]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.252, 0.0427], (-3.195, -1.252], (0.0427, 1.259], (-3.195, -1.252], (1.259, 3.024], ..., (0.0427, 1.259], (-1.252, 0.0427], (-1.252, 0.0427], (0.0427, 1.259], (-1.252, 0.0427]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.195, -1.252] < (-1.252, 0.0427] < (0.0427, 1.259] < (1.259, 3.024]]

### Detecting and Filtering Outliers

In [103]:
data = pd.DataFrame(np.random.randn(1000, 4))
print(data.head(5))
data.describe()
# generates 1000 rows, 4 columns comprised of random, normally distributed numbers

          0         1         2         3
0 -1.207864 -0.079418 -0.067526  0.820389
1  0.039555  0.346481 -1.950188 -0.400798
2 -0.269067  0.997121 -0.401784 -0.317724
3  0.752058  0.663380  0.871852  0.746692
4 -1.607917 -1.455519  2.209239 -1.409472

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.007599     0.022832    -0.013042     0.015812
std       1.037680     0.945130     1.023250     1.005992
min      -3.255825    -3.398085    -2.999799    -2.938085
25%      -0.703696    -0.572087    -0.677825    -0.677184
50%      -0.016326     0.062818     0.007262     0.020683
75%       0.694186     0.640000     0.650353     0.691926
max       3.897527     3.521136     3.144389     3.398428

In [111]:
section = data[3]
print(section)
#returns column 3

0      0.820389
1     -0.400798
2     -0.317724
3      0.746692
4     -1.409472
         ...
995   -0.766023
996   -1.642337
997   -0.312178
998   -1.076197
999    0.988070
Name: 3, Length: 1000, dtype: float64

In [112]:
section[np.abs(section) > 3]
# within section, returns rows in which the absolute value > 3

404    3.003284
989    3.398428
Name: 3, dtype: float64

In [113]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
10  -0.780620  0.622791  3.144389  0.391328
276  3.897527  0.677627 -0.248984  0.277221
294  1.638731  3.160760 -0.718885 -1.716556
304  3.048747  0.264626 -0.382165  0.203685
404 -2.127013 -0.334487 -1.361069  3.003284
503  1.035012 -3.398085 -0.349365  1.440938
552 -1.448936  3.484365 -0.593819 -0.026805
590  0.928319  3.521136  1.337858  1.431504
618 -3.255825  0.213170  0.328749  2.478106
989 -0.522213  0.148179 -2.259163  3.398428

In [114]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.008290     0.022064    -0.013186     0.015410
std       1.033768     0.939797     1.022814     1.004719
min      -3.000000    -3.000000    -2.999799    -2.938085
25%      -0.703696    -0.572087    -0.677825    -0.677184
50%      -0.016326     0.062818     0.007262     0.020683
75%       0.694186     0.640000     0.650353     0.691926
max       3.000000     3.000000     3.000000     3.000000

In [115]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0  1.0
1  1.0  1.0 -1.0 -1.0
2 -1.0  1.0 -1.0 -1.0
3  1.0  1.0  1.0  1.0
4 -1.0 -1.0  1.0 -1.0

### Permutation and Random Sampling

In [143]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

# Randomly permute a sequence, or return a permuted range.
# If `x` is a multi-dimensional array, it is only shuffled along its first index.

array([4, 0, 2, 1, 3])

In [144]:
df
df.take(sampler)

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15

In [145]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
1   4   5   6   7

In [146]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

0    5
2   -1
1    7
0    5
2   -1
1    7
0    5
3    6
1    7
1    7
dtype: int64

### Computing Indicator/Dummy Variables

In [ ]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
pd.get_dummies(df['key'])

In [ ]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

In [ ]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)
movies[:10]

In [ ]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)

In [ ]:
genres

In [ ]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [ ]:
gen = movies.genres[0]
gen.split('|')
dummies.columns.get_indexer(gen.split('|'))

In [ ]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [ ]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

In [ ]:
np.random.seed(12345)
values = np.random.rand(10)
values
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

## String Manipulation

### String Object Methods

In [ ]:
val = 'a,b,  guido'
val.split(',')

In [ ]:
pieces = [x.strip() for x in val.split(',')]
pieces

In [ ]:
first, second, third = pieces
first + '::' + second + '::' + third

In [ ]:
'::'.join(pieces)

In [ ]:
'guido' in val
val.index(',')
val.find(':')

In [ ]:
val.index(':')

In [ ]:
val.count(',')

In [ ]:
val.replace(',', '::')
val.replace(',', '')

### Regular Expressions

In [121]:
import re
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [122]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [123]:
regex.findall(text)

['    ', '\t ', '  \t']

In [124]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [ ]:
regex.findall(text)

In [ ]:
m = regex.search(text)
m
text[m.start():m.end()]

In [ ]:
print(regex.match(text))

In [ ]:
print(regex.sub('REDACTED', text))

In [ ]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [ ]:
m = regex.match('wesm@bright.net')
m.groups()

In [ ]:
regex.findall(text)

In [ ]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

### Vectorized String Functions in pandas

In [117]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
print(data)
data.isnull()

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [118]:
data.str.contains('gmail')
# returns whether/not each string contains 'gmail'

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [129]:
pattern
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [dave@google.com]
Steve    [steve@gmail.com]
Rob        [rob@gmail.com]
Wes                    NaN
dtype: object

In [130]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [138]:
matches.bool.get()

AttributeError: 'function' object has no attribute 'get'

In [139]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [140]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS

## Conclusion